CSI API ETABS v1

# cDesignConcreteTS_500_2000_R2018 Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDCoTS_500_2000_R2018 TS_500_2000_R2018 { get; }

    ReadOnly Property TS_500_2000_R2018 As cDCoTS_500_2000_R2018
    	Get

    Dim instance As cDesignConcrete
    Dim value As cDCoTS_500_2000_R2018

    value = instance.TS_500_2000_R2018

    property cDCoTS_500_2000_R2018^ TS_500_2000_R2018 {
    	cDCoTS_500_2000_R2018^ get ();
    }

    abstract TS_500_2000_R2018 : cDCoTS_500_2000_R2018 with get

#### Property Value

Type: cDCoTS_500_2000_R2018

See Also

#### Reference

cDesignConcrete Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com